<a href="https://colab.research.google.com/github/Dmckinney821/99bottle/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
labels = ['a','b','c']
mylist= [10,20,30]
arr=np.array([10,20,30])
d = {'a':10, 'b':20,'c':30}

In [6]:
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(mylist,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [0]:
salesQ1 = pd.Series(data=[250,250,200,140],index=['usa','china','india','brazil'])

In [14]:
salesQ1

usa       250
china     250
india     200
brazil    140
dtype: int64

In [16]:
salesQ1

usa       250
china     250
india     200
brazil    140
dtype: int64

In [0]:
salesQ1 = pd.Series(data=[250,250,200,140],index=['usa','china','india','japan'])

In [0]:
salesQ2 = pd.Series(data=[250,250,200,140],index=['usa','china','india','brazil'])

In [19]:
salesQ1

usa      250
china    250
india    200
japan    140
dtype: int64

In [20]:
salesQ1

usa      250
china    250
india    200
japan    140
dtype: int64

In [21]:
salesQ2

usa       250
china     250
india     200
brazil    140
dtype: int64

In [22]:
salesQ2['china']

250

In [24]:
salesQ2[2]

200

In [25]:
salesQ1 + salesQ2

brazil      NaN
china     500.0
india     400.0
japan       NaN
usa       500.0
dtype: float64

In [0]:
columns = ['W', 'X', 'Y', 'Z']

In [0]:
index = ['A', 'B', 'C', 'D']

In [0]:
from numpy.random import randint

In [0]:
np.random.seed(42)
data = randint(-100,100,(4,4))

In [38]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51]])

In [0]:
df = pd.DataFrame(data,index,columns)

In [40]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [44]:
df[['W','X']]

    W   X
A   2  79
B   6 -29
C   2  21
D  16  -1

In [43]:
type(df['W'])

pandas.core.series.Series

In [0]:
df['new'] = df['W'] + df['Y']

In [47]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19

In [48]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [49]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19

In [0]:
df = df.drop('new',axis=1)

In [51]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [52]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [53]:
df.loc[['A','D']]

    W   X  Y   Z
A   2  79 -8 -86
D  16  -1  3  51

In [54]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [55]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [56]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51

In [57]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [58]:
df.loc['A','W']

2

In [59]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [60]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [61]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True

In [62]:
df > 8

       W      X      Y      Z
A  False   True  False  False
B  False  False   True  False
C  False   True  False  False
D   True  False  False   True

In [63]:
df[df>9]

      W     X     Y     Z
A   NaN  79.0   NaN   NaN
B   NaN   NaN  88.0   NaN
C   NaN  21.0   NaN   NaN
D  16.0   NaN   NaN  51.0

In [64]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [72]:
df[df['X']>0]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

In [76]:
df[(df['W']>0) & (df['Y']>1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [77]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [78]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51

In [79]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51

In [0]:
new_ind = ['CA', 'NY', 'WY', 'OR']

In [0]:
df['States'] = new_ind

In [82]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR

In [83]:
df.set_index('States')

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51

In [84]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR

In [0]:
df = df.set_index('States')

In [86]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51

In [87]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [88]:
df.describe()

               W         X          Y          Z
count   4.000000   4.00000   4.000000   4.000000
mean    6.500000  17.50000  14.250000 -32.000000
std     6.608076  45.82212  50.598913  64.472216
min     2.000000 -29.00000 -26.000000 -86.000000
25%     2.000000  -8.00000 -12.500000 -81.500000
50%     4.000000  10.00000  -2.500000 -46.500000
75%     8.500000  35.50000  24.250000   3.000000
max    16.000000  79.00000  88.000000  51.000000

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to OR
Data columns (total 4 columns):
W    4 non-null int64
X    4 non-null int64
Y    4 non-null int64
Z    4 non-null int64
dtypes: int64(4)
memory usage: 160.0+ bytes